## Production
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 7 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                RESOURCE                                 |
|----------|-------------------------------------------------------------------------|
| update   | `aws_cloudwatch_metric_alarm.superset_ecs_high_cpu[&quot;celery-beat&quot;]`      |
|          | `aws_cloudwatch_metric_alarm.superset_ecs_high_cpu[&quot;celery-worker&quot;]`    |
|          | `aws_cloudwatch_metric_alarm.superset_ecs_high_cpu[&quot;superset&quot;]`         |
|          | `aws_cloudwatch_metric_alarm.superset_ecs_high_memory[&quot;celery-beat&quot;]`   |
|          | `aws_cloudwatch_metric_alarm.superset_ecs_high_memory[&quot;celery-worker&quot;]` |
|          | `aws_cloudwatch_metric_alarm.superset_ecs_high_memory[&quot;superset&quot;]`      |
|          | `module.superset_ecs.aws_ecs_service.this`                              |
| recreate | `module.superset_ecs.aws_ecs_task_definition.this`                      |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.superset_ecs_high_cpu["celery-beat"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "superset_ecs_high_cpu" {
      ~ alarm_description                     = "`celery-beat` high CPU use over 2 minutes." -> "`celery-beat` high CPU use over 5 minutes."
      ~ evaluation_periods                    = 1 -> 5
        id                                    = "ecs-celery-beat-high-cpu"
      ~ period                                = 120 -> 60
        tags                                  = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
      ~ threshold                             = 50 -> 80
        # (18 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.superset_ecs_high_cpu["celery-worker"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "superset_ecs_high_cpu" {
      ~ alarm_description                     = "`celery-worker` high CPU use over 2 minutes." -> "`celery-worker` high CPU use over 5 minutes."
      ~ evaluation_periods                    = 1 -> 5
        id                                    = "ecs-celery-worker-high-cpu"
      ~ period                                = 120 -> 60
        tags                                  = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
      ~ threshold                             = 50 -> 80
        # (18 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.superset_ecs_high_cpu["superset"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "superset_ecs_high_cpu" {
      ~ alarm_description                     = "`superset` high CPU use over 2 minutes." -> "`superset` high CPU use over 5 minutes."
      ~ evaluation_periods                    = 1 -> 5
        id                                    = "ecs-superset-high-cpu"
      ~ period                                = 120 -> 60
        tags                                  = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
      ~ threshold                             = 50 -> 80
        # (18 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.superset_ecs_high_memory["celery-beat"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "superset_ecs_high_memory" {
      ~ alarm_description                     = "`celery-beat` high memory use over 2 minutes." -> "`celery-beat` high memory use over 5 minutes."
      ~ evaluation_periods                    = 1 -> 5
        id                                    = "ecs-celery-beat-high-memory"
      ~ period                                = 120 -> 60
        tags                                  = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
      ~ threshold                             = 50 -> 80
        # (18 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.superset_ecs_high_memory["celery-worker"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "superset_ecs_high_memory" {
      ~ alarm_description                     = "`celery-worker` high memory use over 2 minutes." -> "`celery-worker` high memory use over 5 minutes."
      ~ evaluation_periods                    = 1 -> 5
        id                                    = "ecs-celery-worker-high-memory"
      ~ period                                = 120 -> 60
        tags                                  = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
      ~ threshold                             = 50 -> 80
        # (18 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.superset_ecs_high_memory["superset"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "superset_ecs_high_memory" {
      ~ alarm_description                     = "`superset` high memory use over 2 minutes." -> "`superset` high memory use over 5 minutes."
      ~ evaluation_periods                    = 1 -> 5
        id                                    = "ecs-superset-high-memory"
      ~ period                                = 120 -> 60
        tags                                  = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
      ~ threshold                             = 50 -> 80
        # (18 unchanged attributes hidden)
    }

  # module.superset_ecs.data.aws_ecs_task_definition.this_latest will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this_latest" {
      + arn                  = (known after apply)
      + arn_without_revision = (known after apply)
      + execution_role_arn   = (known after apply)
      + family               = (known after apply)
      + id                   = (known after apply)
      + network_mode         = (known after apply)
      + revision             = (known after apply)
      + status               = (known after apply)
      + task_definition      = "superset"
      + task_role_arn        = (known after apply)
    }

  # module.superset_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:066023111852:service/superset/superset"
        name                               = "superset"
        tags                               = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:066023111852:task-definition/superset:72" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.superset_ecs.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:066023111852:task-definition/superset:72" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:066023111852:task-definition/superset" -> (known after apply)
      ~ container_definitions    = jsonencode( # whitespace changes
            [
                {
                    command                = [
                        "/app/docker/docker-bootstrap.sh",
                        "app",
                    ]
                    environment            = [
                        {
                            name  = "GOOGLE_AUTH_DOMAIN"
                            value = "superset.cdssandbox.xyz"
                        },
                        {
                            name  = "GOOGLE_OAUTH_EMAIL_DOMAIN"
                            value = "cds-snc.ca"
                        },
                        {
                            name  = "GOOGLE_OAUTH_LOGIN"
                            value = "true"
                        },
                        {
                            name  = "GUNICORN_KEEPALIVE"
                            value = "120"
                        },
                        {
                            name  = "REDIS_HOST"
                            value = "cds-redis.m4q4yy.0001.cac1.cache.amazonaws.com"
                        },
                        {
                            name  = "REDIS_PORT"
                            value = "6379"
                        },
                        {
                            name  = "SUPERSET_DATABASE_DB"
                            value = "superset"
                        },
                    ]
                    essential              = true
                    image                  = "066023111852.dkr.ecr.ca-central-1.amazonaws.com/superset:latest"
                    linuxParameters        = {
                        capabilities = {
                            add  = []
                            drop = [
                                "ALL",
                            ]
                        }
                    }
                    logConfiguration       = {
                        logDriver = "awslogs"
                        options   = {
                            awslogs-group         = "/aws/ecs/superset/superset"
                            awslogs-region        = "ca-central-1"
                            awslogs-stream-prefix = "task"
                        }
                    }
                    mountPoints            = []
                    name                   = "superset"
                    portMappings           = [
                        {
                            containerPort = 8088
                            hostPort      = 8088
                            protocol      = "tcp"
                        },
                    ]
                    readonlyRootFilesystem = false
                    secrets                = [
                        {
                            name      = "GOOGLE_OAUTH_CLIENT_ID"
                            valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/google_oauth_client_id"
                        },
                        {
                            name      = "GOOGLE_OAUTH_CLIENT_SECRET"
                            valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/google_oauth_client_secret"
                        },
                        {
                            name      = "SUPERSET_DATABASE_HOST"
                            valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_host"
                        },
                        {
                            name      = "SUPERSET_DATABASE_PASSWORD"
                            valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_password"
                        },
                        {
                            name      = "SUPERSET_DATABASE_USER"
                            valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_username"
                        },
                        {
                            name      = "SUPERSET_SECRET_KEY"
                            valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_secret_key"
                        },
                    ]
                    systemControls         = []
                    volumesFrom            = []
                },
            ]
        )
      ~ cpu                      = "1024" -> "2048" # forces replacement
      ~ id                       = "superset" -> (known after apply)
      ~ revision                 = 72 -> (known after apply)
        tags                     = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 7 to change, 1 to destroy.

Warning: Argument is deprecated

  with module.athena_bucket.aws_s3_bucket.this,
  on .terraform/modules/athena_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_data_catalog.data_lake"]
WARN - plan.json - main - Missing Common Tags: ["aws_elasticache_subnet_group.superset"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.superset_athena_read"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.superset_athena_read"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.superset_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.superset_waf_logs"]

25 tests, 19 passed, 6 warnings, 0 failures, 0 exceptions

```

</details>
